[
  {
    "name": "trace_targets",
    "description": "Traces A* paths between a list of target coordinates, avoiding obstacles and saving all reachable points to a file and a visualization image. At each checkpoint (the final point of each segment to a target), an optional delay (in milliseconds) can be written as a third CSV column for that point.\n\nOutput: Saves the improved path points to a text file (x,y or x,y,delay_ms at checkpoints) and renders a visual path overlay image with arena, obstacles, and path segments.\n\nExample Usage: `trace_targets([(50,50), (150,150)], 'Targets/improved.txt', start=(10,10), data_folder='Data', spacing=5, delay=1500, out_path='Data/trace_overlay.png')` returns: Confirmation message indicating path generation success and saved file location.",
    "parameters": {
      "type": "OBJECT",
      "properties": {
        "input_target_list": {
          "type": "ARRAY",
          "description": "Required. A list of (x,y) target coordinates. Provide as a list of lists or tuples, e.g., [[50, 50], [150, 150]].",
          "items": {
            "type": "ARRAY",
            "items": {
              "type": "INTEGER"
            }
          }
        },
        "output_target_path": {
          "type": "STRING",
          "description": "Path to write the concatenated reachable points to a plain-text CSV file."
        },
        "start": {
          "type": "ARRAY",
          "description": "Optional start position (x, y). If not provided, the robot's current position from the data folder will be used.",
          "items": {
            "type": "INTEGER"
          }
        },
        "data_folder": {
          "type": "STRING",
          "description": "Folder containing arena data, obstacle files, and the camera frame image. Defaults to 'Data'."
        },
        "spacing": {
          "type": "INTEGER",
          "description": "Optional dilation spacing (in pixels) around obstacles to ensure safe A* navigation. Default 50."
        },
        "delay": {
          "type": "INTEGER",
          "description": "Optional delay (in milliseconds) to apply at EACH checkpoint. You may also pass an array of integers (one per target) if your caller supports non-scalar types; e.g., [1000, 0, 2000]. When provided, the delay is written only on the last point of each segment."
        },
        "out_path": {
          "type": "STRING",
          "description": "Path to save the output visualization PNG showing arena, obstacles, and traced paths."
        }
      },
      "required": [
        "input_target_list"
      ]
    }
  }
]
